IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DMASS0_CBASS_0_CBASS_DMSC_QOS.xml
<module name="DMASS0_CBASS_0_CBASS_DMSC_QOS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CBASS_DMSC_QOS_REGS_sec_proxy_dst_map0" acronym="CBASS_DMSC_QOS_REGS_sec_proxy_dst_map0" offset="0x100" width="32" description="The Map Register defines the fields for the master sec_proxy.dst per channel.">
		<bitfield id="ATYPE" width="2" begin="29" end="28" resetval="0x0" description="epriority signal for channel N. 0 = physical. 1 = intermediate. 2 = virtual. 3 = physical with coherence." range="29 - 28" rwaccess="R/W"/> 
		<bitfield id="EPRIORITY" width="3" begin="14" end="12" resetval="0x7" description="epriority signal for channel N." range="14 - 12" rwaccess="R/W"/> 
		<bitfield id="QOS" width="3" begin="2" end="0" resetval="0x0" description="qos signal for channel N." range="2 - 0" rwaccess="R/W"/>
	</register>
</module>